In [25]:
import pandas as pd

Loading Prepared Data

In [26]:
jpyusd = pd.read_csv("prepared_Forex_JPYUSD.csv")

In [27]:
us_events = pd.read_csv("prepared_events_US.csv")

In [28]:
japan_events = pd.read_csv("prepared_events_Japan.csv")

Checking the start and dates of the data

In [29]:
jpyusd.head(2)

         Date        Open        High         Low       Close   Adj Close
0  2005-01-03  102.519997  103.430000  102.349998  102.739998  102.739998
1  2005-01-04  102.730003  104.739998  102.459999  104.339996  104.339996

In [30]:
us_events.head(2)

      SQLDATE  USGoldSteinScale  USNumMentions
0  2005-02-22             -10.0           10.0
1  2005-02-23               0.0            0.0

In [31]:
japan_events.head(2)

      SQLDATE  JPGoldSteinScale  JPNumMentions
0  2005-04-01             -10.0            7.0
1  2005-04-02               0.0            0.0

Rename SQLDATE column for convenience

In [32]:
us_events.rename(columns={"SQLDATE":"Date"}, inplace=True)
japan_events.rename(columns={"SQLDATE":"Date"}, inplace=True)

Droping data before '2005-05-01'

In [33]:
jpyusd['Date'] = pd.to_datetime(jpyusd['Date'])
us_events['Date'] = pd.to_datetime(us_events['Date'])
japan_events['Date'] = pd.to_datetime(japan_events['Date'])

# Filter rows with dates on or after '2005-05-01'
jpyusd = jpyusd[jpyusd['Date'] >= '2005-05-01']
us_events = us_events[us_events['Date'] >= '2005-05-01']
japan_events = japan_events[japan_events['Date'] >= '2005-05-01']

In [34]:
jpyusd.head(2)

          Date        Open        High         Low       Close   Adj Close
118 2005-05-01  105.120003  105.410004  104.900002  105.099998  105.099998
119 2005-05-02  105.120003  105.410004  104.900002  105.099998  105.099998

In [35]:
us_events.head(2)

         Date  USGoldSteinScale  USNumMentions
68 2005-05-01               0.0            0.0
69 2005-05-02             -10.0           10.0

In [36]:
japan_events.head(2)

         Date  JPGoldSteinScale  JPNumMentions
30 2005-05-01               0.0            0.0
31 2005-05-02               7.0           10.0

Checking End Date

In [37]:
jpyusd.tail(2)

           Date        Open        High         Low       Close   Adj Close
6751 2023-06-29  144.389008  144.891998  144.138000  144.389008  144.389008
6752 2023-06-30  144.779999  145.033005  144.227997  144.779999  144.779999

In [38]:
us_events.tail(2)

           Date  USGoldSteinScale  USNumMentions
6701 2023-06-29          0.522759       9.093127
6702 2023-06-30          0.899347       9.083835

In [39]:
japan_events.tail(2)

           Date  JPGoldSteinScale  JPNumMentions
6663 2023-06-29          3.625397      10.626984
6664 2023-06-30          3.906504       9.715447

Check Data Size

In [40]:
jpyusd.shape

(6635, 6)

In [41]:
us_events.shape

(6635, 3)

In [42]:
japan_events.shape

(6635, 3)

Set 'Date' as index for each DataFrame

In [43]:
jpyusd.set_index('Date', inplace=True)
us_events.set_index('Date', inplace=True)
japan_events.set_index('Date', inplace=True)

Check if the dates are aligned

In [44]:
dates_aligned = (jpyusd.index.equals(us_events.index) and us_events.index.equals(japan_events.index))

print(dates_aligned)

True

Merging the data frames to one

In [45]:
merged_JPYUSD = pd.concat([jpyusd, us_events, japan_events], axis=1)

In [46]:
merged_JPYUSD.head()

,Open,High,Low,Close,Adj Close,USGoldSteinScale,USNumMentions,JPGoldSteinScale,JPNumMentions
Date,,,,,,,,,
2005-05-01,105.120003,105.410004,104.900002,105.099998,105.099998,0.0,0.0,0.0,0.0
2005-05-02,105.120003,105.410004,104.900002,105.099998,105.099998,-10.0,10.0,7.0,10.0
2005-05-03,105.089996,105.320000,104.839996,104.870003,104.870003,0.0,0.0,0.0,0.0
2005-05-04,104.849998,104.989998,104.199997,104.519997,104.519997,0.0,0.0,7.0,10.0
2005-05-05,104.510002,104.669998,104.250000,104.510002,104.510002,0.0,0.0,7.0,10.0

In [47]:
merged_JPYUSD.tail()

,Open,High,Low,Close,Adj Close,USGoldSteinScale,USNumMentions,JPGoldSteinScale,JPNumMentions
Date,,,,,,,,,
2023-06-26,143.541000,143.682007,142.973007,143.541000,143.541000,0.452791,9.052184,2.858824,8.882353
2023-06-27,143.460007,144.162994,143.292007,143.460007,143.460007,0.458606,8.961518,3.149600,8.800000
2023-06-28,143.882004,144.595001,143.735992,143.882004,143.882004,0.817137,8.968750,3.561947,9.079646
2023-06-29,144.389008,144.891998,144.138000,144.389008,144.389008,0.522759,9.093127,3.625397,10.626984
2023-06-30,144.779999,145.033005,144.227997,144.779999,144.779999,0.899347,9.083835,3.906504,9.715447

In [48]:
merged_JPYUSD.to_csv("prepared_with_events_JPYUSD.csv", index="None")